In [2]:
import pandas as pd  # alias name

df=pd.read_csv("employee.csv")

print(df.head())

   emp_id     name department  age  salary  hire_year       city
0       1    Alice         IT   28   60000       2021  Bangalore
1       2      Bob         HR   35   50000       2019      Delhi
2       3  Charlie         IT   30   70000       2020  Hyderabad
3       4    David    Finance   45   90000       2015     Mumbai
4       5      Eva         HR   26   48000       2022       Pune

In [3]:
import numpy as np
import pandas as pd
print(np.__version__, pd.__version__)

1.26.4 2.1.4

In [4]:
df[(df['department']=='IT') & (df['salary']>80000) ]

    emp_id    name department  age  salary  hire_year       city
18      19   Steve         IT   42   88000       2016  Bangalore
23      24  Xavier         IT   45   91000       2015    Chennai
32      33  George         IT   37   81000       2017  Hyderabad
36      37   Kevin         IT   39   85000       2016      Delhi
44      45     Sam         IT   48   93000       2014    Chennai
48      49    Will         IT   41   88000       2015       Pune

In [5]:
df[df['age']>40]

    emp_id    name department  age  salary  hire_year       city
3        4   David    Finance   45   90000       2015     Mumbai
10      11    Kate         HR   41   62000       2016    Chennai
14      15   Oscar    Finance   50   95000       2014     Mumbai
18      19   Steve         IT   42   88000       2016  Bangalore
23      24  Xavier         IT   45   91000       2015    Chennai
28      29    Carl         HR   44   68000       2016    Chennai
31      32   Fiona  Marketing   41   64000       2015     Mumbai
34      35   Isaac    Finance   46   92000       2014    Chennai
38      39    Mark    Finance   52   98000       2013       Pune
42      43  Quincy    Finance   41   87000       2017     Mumbai
44      45     Sam         IT   48   93000       2014    Chennai
48      49    Will         IT   41   88000       2015       Pune

In [6]:
df.groupby('department').size()

department
Finance      11
HR           12
IT           16
Marketing    11
dtype: int64

In [7]:
df.groupby('department')['salary'].max()

department
Finance      98000
HR           68000
IT           93000
Marketing    65000
Name: salary, dtype: int64

In [8]:
df.groupby('department').size()
 
# Max salary per department

department
Finance      11
HR           12
IT           16
Marketing    11
dtype: int64

In [9]:
 
df.groupby('department')['salary'].max()

department
Finance      98000
HR           68000
IT           93000
Marketing    65000
Name: salary, dtype: int64

In [10]:
 
# Total salary per department
 
df.groupby('department')['salary'].sum()

department
Finance       943000
HR            657000
IT           1212000
Marketing     630000
Name: salary, dtype: int64

In [11]:
# Average age per department
 
df.groupby('department')['age'].mean()

department
Finance      40.545455
HR           32.000000
IT           35.000000
Marketing    33.181818
Name: age, dtype: float64

In [12]:
# Employees from Bangalore
 
df[df['city'] == 'Bangalore']

    emp_id    name department  age  salary  hire_year       city
0        1   Alice         IT   28   60000       2021  Bangalore
6        7   Grace         IT   32   72000       2019  Bangalore
12      13     Mia         IT   27   61000       2022  Bangalore
18      19   Steve         IT   42   88000       2016  Bangalore
24      25    Yara         HR   30   55000       2020  Bangalore
29      30   Daisy         IT   31   72000       2020  Bangalore
35      36   Julia  Marketing   34   58000       2019  Bangalore
40      41  Oliver         IT   33   73000       2019  Bangalore
45      46   Tracy         HR   29   53000       2021  Bangalore

In [13]:
# Employees per city
 
df.groupby('city').size()

city
Bangalore    9
Chennai      9
Delhi        9
Hyderabad    5
Mumbai       9
Pune         9
dtype: int64

In [14]:
# Average salary per city
 
df.groupby('city')['salary'].mean()

city
Bangalore    65777.777778
Chennai      73777.777778
Delhi        65111.111111
Hyderabad    74000.000000
Mumbai       72333.333333
Pune         64333.333333
Name: salary, dtype: float64

In [15]:
# Highest paid employee per city
 
df.loc[df.groupby('city')['salary'].idxmax()]

    emp_id    name department  age  salary  hire_year       city
18      19   Steve         IT   42   88000       2016  Bangalore
44      45     Sam         IT   48   93000       2014    Chennai
36      37   Kevin         IT   39   85000       2016      Delhi
32      33  George         IT   37   81000       2017  Hyderabad
14      15   Oscar    Finance   50   95000       2014     Mumbai
38      39    Mark    Finance   52   98000       2013       Pune

In [16]:
# Employees working in Pune
 
df[df['city'] == 'Pune']

    emp_id    name department  age  salary  hire_year  city
4        5     Eva         HR   26   48000       2022  Pune
11      12     Leo    Finance   36   78000       2019  Pune
16      17   Quinn         HR   31   54000       2020  Pune
22      23   Wendy  Marketing   28   51000       2021  Pune
27      28   Bella  Marketing   35   61000       2018  Pune
33      34  Hannah         HR   28   52000       2021  Pune
38      39    Mark    Finance   52   98000       2013  Pune
43      44    Rita  Marketing   26   49000       2022  Pune
48      49    Will         IT   41   88000       2015  Pune

In [17]:
df.groupby('city').size()

city
Bangalore    9
Chennai      9
Delhi        9
Hyderabad    5
Mumbai       9
Pune         9
dtype: int64

In [18]:
# Average salary per city
 
df.groupby('city')['salary'].mean()

city
Bangalore    65777.777778
Chennai      73777.777778
Delhi        65111.111111
Hyderabad    74000.000000
Mumbai       72333.333333
Pune         64333.333333
Name: salary, dtype: float64

In [19]:
# Highest paid employee per city
 
df.loc[df.groupby('city')['salary'].idxmax()]

    emp_id    name department  age  salary  hire_year       city
18      19   Steve         IT   42   88000       2016  Bangalore
44      45     Sam         IT   48   93000       2014    Chennai
36      37   Kevin         IT   39   85000       2016      Delhi
32      33  George         IT   37   81000       2017  Hyderabad
14      15   Oscar    Finance   50   95000       2014     Mumbai
38      39    Mark    Finance   52   98000       2013       Pune

In [22]:
# Employees working in Pune
 
df[df['city'] == 'Pune']

    emp_id    name department  age  salary  hire_year  city
4        5     Eva         HR   26   48000       2022  Pune
11      12     Leo    Finance   36   78000       2019  Pune
16      17   Quinn         HR   31   54000       2020  Pune
22      23   Wendy  Marketing   28   51000       2021  Pune
27      28   Bella  Marketing   35   61000       2018  Pune
33      34  Hannah         HR   28   52000       2021  Pune
38      39    Mark    Finance   52   98000       2013  Pune
43      44    Rita  Marketing   26   49000       2022  Pune
48      49    Will         IT   41   88000       2015  Pune